       IDENTIFICATION DIVISION.
       PROGRAM-ID. TestCBL.
TEST  *Test Comment

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           GOBACK.

       END PROGRAM TestCBL.
