//SPLCALL JOB 'SPLCALL',CLASS=A,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*
//*
//STEP1 EXEC PGM=MAIN
//*
//*STEP2 EXEC PGM=MAIN2
//* 
//*
